//Класс Container является реализацией по умолчанию интерфейса IContainer.

/* Контейнерами называются объекты, инкапсулирующие ноль или более компонентов. 
   В данном контексте имеется в виду логическая, а не визуальная вложенность компонентов в контейнер. 
   Компоненты и контейнеры можно использовать в различных скриптах, как визуальных, так и не в визуальных.

   Компоненты в контейнере организованы в форме списка FIFO ("первым пришел, первым ушел"), 
   который также определяет порядок компонентов в контейнере. 
   Новые компоненты добавляются в конец списка. 
*/

