using System;    //импортируем System, для консоли

namespace b2
{
    class Program
    {
        static void Main(string[] args)
        {
           System.Console.WriteLine("---");    //полная форма, если нет импорта System


           int[] lst;             //объявили переменную
           lst = new int[3];      //инициализировали переменную
           lst[0] = 0;
           lst[1] = 1;            //доступ к элементам массива
           lst[2] = 2;

           int[] lst2 = {1, 2, 3, 4, 5, 6, 7};    //статическое создание массива

           string[] Hex = {"0","1","2","3", "4","5","6","7", "8","9","a","b", "c","d","e","f"};   //аналогично


           int[,]  xy  = new int[3, 3];           //2-х мерный массив
           int[,,] xyz = new int[3, 3, 3];        //3-х мерный массив

           int[,]  XY = { {1, 2}, {10, 20} };     //статически 2-х  и 3-х ниже

           int[,,]XYZ = { 
                          {//0                             X 
                              {1,2},   {3,4}     //0, 1    Z
                          },   //0     //1                 Y

                          {//1                             X
                              {11,22}, {33,44}   //0, 1    Z
                          }   //0      //1                 Y
                        };

         ///foreach(string s in Hex)       //перебор содержимого строкового массива
         foreach(var s in Hex)             //так можно перебирать любые типы
            Console.WriteLine("{0}", s);     //форматный вывод

         Hex = null;   //обнуляем ссылку

         object[] objs = new object[3];    //массив с разнотипными объектами
         objs[0] = 1; objs[1] = "123"; objs[2] = 2.0;     //инициализация элементов массива значениями

        }
    }
}
